podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// Signal mapping for PTA20 pin
//   <o> PTA20 [GPIOA_20, RESET_b]<name=PTA20_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA20 pin
//     <-2=> RESET_b (reset default)<selection=RESET_b_PIN_SEL,PTA20 (reset default)>
//     <1=> GPIOA_20<selection=GPIOA_20_PIN_SEL,PTA20>
//     <7=> RESET_b<selection=RESET_b_PIN_SEL,PTA20>
//     <-2=> Default
#define PTA20_SIG_SEL        -2

// </h>

// <h> Port B Pins

// Signal mapping for PTB0 pin
//   <o> PTB0 (Alias:A0) [LCD_P0/ADC0_SE8, GPIOB_0/LLWU_P5, I2C0_SCL, TPM1_CH0, LCD_P0_fault]<name=PTB0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB0 pin
//     <-2=> LCD_P0/ADC0_SE8 (reset default)<selection=LCD_P0_PIN_SEL,PTB0 (Alias:A0) (reset default)><selection=ADC0_SE8_PIN_SEL,PTB0 (Alias:A0) (reset default)>
//     <0=> LCD_P0/ADC0_SE8<selection=LCD_P0_PIN_SEL,PTB0 (Alias:A0)><selection=ADC0_SE8_PIN_SEL,PTB0 (Alias:A0)>
//     <1=> GPIOB_0/LLWU_P5<selection=GPIOB_0_PIN_SEL,PTB0 (Alias:A0)><selection=LLWU_P5_PIN_SEL,PTB0 (Alias:A0)>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB0 (Alias:A0)>
//     <3=> TPM1_CH0<selection=TPM1_CH0_PIN_SEL,PTB0 (Alias:A0)>
//     <7=> LCD_P0_fault<selection=LCD_P0_fault_PIN_SEL,PTB0 (Alias:A0)>
//     <0=> Default
#define PTB0_SIG_SEL         0

// Signal mapping for PTB1 pin
//   <o> PTB1 (Alias:A1) [LCD_P1/ADC0_SE9, GPIOB_1, I2C0_SDA, TPM1_CH1, LCD_P1_fault]<name=PTB1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB1 pin
//     <-2=> LCD_P1/ADC0_SE9 (reset default)<selection=LCD_P1_PIN_SEL,PTB1 (Alias:A1) (reset default)><selection=ADC0_SE9_PIN_SEL,PTB1 (Alias:A1) (reset default)>
//     <0=> LCD_P1/ADC0_SE9<selection=LCD_P1_PIN_SEL,PTB1 (Alias:A1)><selection=ADC0_SE9_PIN_SEL,PTB1 (Alias:A1)>
//     <1=> GPIOB_1<selection=GPIOB_1_PIN_SEL,PTB1 (Alias:A1)>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB1 (Alias:A1)>
//     <3=> TPM1_CH1<selection=TPM1_CH1_PIN_SEL,PTB1 (Alias:A1)>
//     <7=> LCD_P1_fault<selection=LCD_P1_fault_PIN_SEL,PTB1 (Alias:A1)>
//     <0=> Default
#define PTB1_SIG_SEL         0

// Signal mapping for PTB2 pin
//   <o> PTB2 (Alias:A2) [LCD_P2/ADC0_SE12, GPIOB_2, I2C0_SCL, TPM2_CH0, LCD_P2_fault]<name=PTB2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB2 pin
//     <-2=> LCD_P2/ADC0_SE12 (reset default)<selection=LCD_P2_PIN_SEL,PTB2 (Alias:A2) (reset default)><selection=ADC0_SE12_PIN_SEL,PTB2 (Alias:A2) (reset default)>
//     <0=> LCD_P2/ADC0_SE12<selection=LCD_P2_PIN_SEL,PTB2 (Alias:A2)><selection=ADC0_SE12_PIN_SEL,PTB2 (Alias:A2)>
//     <1=> GPIOB_2<selection=GPIOB_2_PIN_SEL,PTB2 (Alias:A2)>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB2 (Alias:A2)>
//     <3=> TPM2_CH0<selection=TPM2_CH0_PIN_SEL,PTB2 (Alias:A2)>
//     <7=> LCD_P2_fault<selection=LCD_P2_fault_PIN_SEL,PTB2 (Alias:A2)>
//     <0=> Default
#define PTB2_SIG_SEL         0

// Signal mapping for PTB3 pin
//   <o> PTB3 (Alias:A3) [LCD_P3/ADC0_SE13, GPIOB_3, I2C0_SDA, TPM2_CH1, LCD_P3_fault]<name=PTB3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB3 pin
//     <-2=> LCD_P3/ADC0_SE13 (reset default)<selection=LCD_P3_PIN_SEL,PTB3 (Alias:A3) (reset default)><selection=ADC0_SE13_PIN_SEL,PTB3 (Alias:A3) (reset default)>
//     <0=> LCD_P3/ADC0_SE13<selection=LCD_P3_PIN_SEL,PTB3 (Alias:A3)><selection=ADC0_SE13_PIN_SEL,PTB3 (Alias:A3)>
//     <1=> GPIOB_3<selection=GPIOB_3_PIN_SEL,PTB3 (Alias:A3)>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB3 (Alias:A3)>
//     <3=> TPM2_CH1<selection=TPM2_CH1_PIN_SEL,PTB3 (Alias:A3)>
//     <7=> LCD_P3_fault<selection=LCD_P3_fault_PIN_SEL,PTB3 (Alias:A3)>
//     <0=> Default
#define PTB3_SIG_SEL         0

// Signal mapping for PTB16 pin
//   <o> PTB16 [LCD_P12, GPIOB_16, SPI1_MOSI, LPUART0_RX, TPM_CLKIN0, SPI1_MISO, LCD_P12_fault]<name=PTB16_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB16 pin
//     <-2=> LCD_P12 (reset default)<selection=LCD_P12_PIN_SEL,PTB16 (reset default)>
//     <0=> LCD_P12<selection=LCD_P12_PIN_SEL,PTB16>
//     <1=> GPIOB_16<selection=GPIOB_16_PIN_SEL,PTB16>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTB16>
//     <3=> LPUART0_RX<selection=LPUART0_RX_PIN_SEL,PTB16>
//     <4=> TPM_CLKIN0<selection=TPM_CLKIN0_PIN_SEL,PTB16>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTB16>
//     <7=> LCD_P12_fault<selection=LCD_P12_fault_PIN_SEL,PTB16>
//     <-2=> Default
#define PTB16_SIG_SEL        -2

// Signal mapping for PTB17 pin
//   <o> PTB17 [LCD_P13, GPIOB_17, SPI1_MISO, LPUART0_TX, TPM_CLKIN1, SPI1_MOSI, LCD_P13_fault]<name=PTB17_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB17 pin
//     <-2=> LCD_P13 (reset default)<selection=LCD_P13_PIN_SEL,PTB17 (reset default)>
//     <0=> LCD_P13<selection=LCD_P13_PIN_SEL,PTB17>
//     <1=> GPIOB_17<selection=GPIOB_17_PIN_SEL,PTB17>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTB17>
//     <3=> LPUART0_TX<selection=LPUART0_TX_PIN_SEL,PTB17>
//     <4=> TPM_CLKIN1<selection=TPM_CLKIN1_PIN_SEL,PTB17>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTB17>
//     <7=> LCD_P13_fault<selection=LCD_P13_fault_PIN_SEL,PTB17>
//     <-2=> Default
#define PTB17_SIG_SEL        -2

// Signal mapping for PTB18 pin
//   <o> PTB18 [LCD_P14, GPIOB_18, TPM2_CH0, I2S0_TX_BCLK, LCD_P14_fault]<name=PTB18_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB18 pin
//     <-2=> LCD_P14 (reset default)<selection=LCD_P14_PIN_SEL,PTB18 (reset default)>
//     <0=> LCD_P14<selection=LCD_P14_PIN_SEL,PTB18>
//     <1=> GPIOB_18<selection=GPIOB_18_PIN_SEL,PTB18>
//     <3=> TPM2_CH0<selection=TPM2_CH0_PIN_SEL,PTB18>
//     <4=> I2S0_TX_BCLK<selection=I2S0_TX_BCLK_PIN_SEL,PTB18>
//     <7=> LCD_P14_fault<selection=LCD_P14_fault_PIN_SEL,PTB18>
//     <-2=> Default
#define PTB18_SIG_SEL        -2

// Signal mapping for PTB19 pin
//   <o> PTB19 [LCD_P15, GPIOB_19, TPM2_CH1, I2S0_TX_FS, LCD_P15_fault]<name=PTB19_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB19 pin
//     <-2=> LCD_P15 (reset default)<selection=LCD_P15_PIN_SEL,PTB19 (reset default)>
//     <0=> LCD_P15<selection=LCD_P15_PIN_SEL,PTB19>
//     <1=> GPIOB_19<selection=GPIOB_19_PIN_SEL,PTB19>
//     <3=> TPM2_CH1<selection=TPM2_CH1_PIN_SEL,PTB19>
//     <4=> I2S0_TX_FS<selection=I2S0_TX_FS_PIN_SEL,PTB19>
//     <7=> LCD_P15_fault<selection=LCD_P15_fault_PIN_SEL,PTB19>
//     <-2=> Default
#define PTB19_SIG_SEL        -2

