podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// </h>

// <h> Port C Pins

// Signal mapping for PTC0 pin
//   <o> PTC0 [LCD_P20/ADC0_SE14, GPIOC_0, EXTRG_IN, audioUSB_SOF_OUT, CMP0_OUT, I2S0_TXD0, LCD_P20_fault]<name=PTC0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC0 pin
//     <-2=> LCD_P20/ADC0_SE14 (reset default)<selection=LCD_P20_PIN_SEL,PTC0 (reset default)><selection=ADC0_SE14_PIN_SEL,PTC0 (reset default)>
//     <0=> LCD_P20/ADC0_SE14<selection=LCD_P20_PIN_SEL,PTC0><selection=ADC0_SE14_PIN_SEL,PTC0>
//     <1=> GPIOC_0<selection=GPIOC_0_PIN_SEL,PTC0>
//     <3=> EXTRG_IN<selection=EXTRG_IN_PIN_SEL,PTC0>
//     <4=> audioUSB_SOF_OUT<selection=audioUSB_SOF_OUT_PIN_SEL,PTC0>
//     <5=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTC0>
//     <6=> I2S0_TXD0<selection=I2S0_TXD0_PIN_SEL,PTC0>
//     <7=> LCD_P20_fault<selection=LCD_P20_fault_PIN_SEL,PTC0>
//     <-2=> Default
#define PTC0_SIG_SEL         -2

// Signal mapping for PTC1 pin
//   <o> PTC1 (Alias:A5) [LCD_P21/ADC0_SE15, GPIOC_1/LLWU_P6/RTC_CLKIN, I2C1_SCL, TPM0_CH0, I2S0_TXD0, LCD_P21_fault]<name=PTC1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC1 pin
//     <-2=> LCD_P21/ADC0_SE15 (reset default)<selection=LCD_P21_PIN_SEL,PTC1 (Alias:A5) (reset default)><selection=ADC0_SE15_PIN_SEL,PTC1 (Alias:A5) (reset default)>
//     <0=> LCD_P21/ADC0_SE15<selection=LCD_P21_PIN_SEL,PTC1 (Alias:A5)><selection=ADC0_SE15_PIN_SEL,PTC1 (Alias:A5)>
//     <1=> GPIOC_1/LLWU_P6/RTC_CLKIN<selection=GPIOC_1_PIN_SEL,PTC1 (Alias:A5)><selection=LLWU_P6_PIN_SEL,PTC1 (Alias:A5)><selection=RTC_CLKIN_PIN_SEL,PTC1 (Alias:A5)>
//     <2=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTC1 (Alias:A5)>
//     <4=> TPM0_CH0<selection=TPM0_CH0_PIN_SEL,PTC1 (Alias:A5)>
//     <6=> I2S0_TXD0<selection=I2S0_TXD0_PIN_SEL,PTC1 (Alias:A5)>
//     <7=> LCD_P21_fault<selection=LCD_P21_fault_PIN_SEL,PTC1 (Alias:A5)>
//     <0=> Default
#define PTC1_SIG_SEL         0

// Signal mapping for PTC2 pin
//   <o> PTC2 (Alias:A4) [LCD_P22/ADC0_SE11, GPIOC_2, I2C1_SDA, TPM0_CH1, I2S0_TX_FS, LCD_P22_fault]<name=PTC2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC2 pin
//     <-2=> LCD_P22/ADC0_SE11 (reset default)<selection=LCD_P22_PIN_SEL,PTC2 (Alias:A4) (reset default)><selection=ADC0_SE11_PIN_SEL,PTC2 (Alias:A4) (reset default)>
//     <0=> LCD_P22/ADC0_SE11<selection=LCD_P22_PIN_SEL,PTC2 (Alias:A4)><selection=ADC0_SE11_PIN_SEL,PTC2 (Alias:A4)>
//     <1=> GPIOC_2<selection=GPIOC_2_PIN_SEL,PTC2 (Alias:A4)>
//     <2=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTC2 (Alias:A4)>
//     <4=> TPM0_CH1<selection=TPM0_CH1_PIN_SEL,PTC2 (Alias:A4)>
//     <6=> I2S0_TX_FS<selection=I2S0_TX_FS_PIN_SEL,PTC2 (Alias:A4)>
//     <7=> LCD_P22_fault<selection=LCD_P22_fault_PIN_SEL,PTC2 (Alias:A4)>
//     <0=> Default
#define PTC2_SIG_SEL         0

// Signal mapping for PTC3 pin
//   <o> PTC3 [LCD_P23, GPIOC_3/LLWU_P7, SPI1_SCK, LPUART1_RX, TPM0_CH2, CLKOUT, I2S0_TX_BCLK, LCD_P23_fault]<name=PTC3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC3 pin
//     <-2=> LCD_P23 (reset default)<selection=LCD_P23_PIN_SEL,PTC3 (reset default)>
//     <0=> LCD_P23<selection=LCD_P23_PIN_SEL,PTC3>
//     <1=> GPIOC_3/LLWU_P7<selection=GPIOC_3_PIN_SEL,PTC3><selection=LLWU_P7_PIN_SEL,PTC3>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTC3>
//     <3=> LPUART1_RX<selection=LPUART1_RX_PIN_SEL,PTC3>
//     <4=> TPM0_CH2<selection=TPM0_CH2_PIN_SEL,PTC3>
//     <5=> CLKOUT<selection=CLKOUT_PIN_SEL,PTC3>
//     <6=> I2S0_TX_BCLK<selection=I2S0_TX_BCLK_PIN_SEL,PTC3>
//     <7=> LCD_P23_fault<selection=LCD_P23_fault_PIN_SEL,PTC3>
//     <-2=> Default
#define PTC3_SIG_SEL         -2

// Signal mapping for PTC4 pin
//   <o> PTC4 [LCD_P24, GPIOC_4/LLWU_P8, SPI0_SS, LPUART1_TX, TPM0_CH3, I2S0_MCLK, LCD_P24_fault]<name=PTC4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC4 pin
//     <-2=> LCD_P24 (reset default)<selection=LCD_P24_PIN_SEL,PTC4 (reset default)>
//     <0=> LCD_P24<selection=LCD_P24_PIN_SEL,PTC4>
//     <1=> GPIOC_4/LLWU_P8<selection=GPIOC_4_PIN_SEL,PTC4><selection=LLWU_P8_PIN_SEL,PTC4>
//     <2=> SPI0_SS<selection=SPI0_SS_PIN_SEL,PTC4>
//     <3=> LPUART1_TX<selection=LPUART1_TX_PIN_SEL,PTC4>
//     <4=> TPM0_CH3<selection=TPM0_CH3_PIN_SEL,PTC4>
//     <5=> I2S0_MCLK<selection=I2S0_MCLK_PIN_SEL,PTC4>
//     <7=> LCD_P24_fault<selection=LCD_P24_fault_PIN_SEL,PTC4>
//     <-2=> Default
#define PTC4_SIG_SEL         -2

// Signal mapping for PTC5 pin
//   <o> PTC5 (Alias:ACCEL_INT1, MAG_INT) [LCD_P25, GPIOC_5/LLWU_P9, SPI0_SCK, LPTMR0_ALT2, I2S0_RXD0, CMP0_OUT, LCD_P25_fault]<name=PTC5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC5 pin
//     <-2=> LCD_P25 (reset default)<selection=LCD_P25_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT) (reset default)>
//     <0=> LCD_P25<selection=LCD_P25_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <1=> GPIOC_5/LLWU_P9<selection=GPIOC_5_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)><selection=LLWU_P9_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <3=> LPTMR0_ALT2<selection=LPTMR0_ALT2_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <4=> I2S0_RXD0<selection=I2S0_RXD0_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <6=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <7=> LCD_P25_fault<selection=LCD_P25_fault_PIN_SEL,PTC5 (Alias:ACCEL_INT1, MAG_INT)>
//     <-2=> Default
#define PTC5_SIG_SEL         -2

// Signal mapping for PTC6 pin
//   <o> PTC6 [LCD_P26/CMP0_IN0, GPIOC_6/LLWU_P10, SPI0_MOSI, EXTRG_IN, I2S0_RX_BCLK, SPI0_MISO, I2S0_MCLK, LCD_P26_fault]<name=PTC6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC6 pin
//     <-2=> LCD_P26/CMP0_IN0 (reset default)<selection=LCD_P26_PIN_SEL,PTC6 (reset default)><selection=CMP0_IN0_PIN_SEL,PTC6 (reset default)>
//     <0=> LCD_P26/CMP0_IN0<selection=LCD_P26_PIN_SEL,PTC6><selection=CMP0_IN0_PIN_SEL,PTC6>
//     <1=> GPIOC_6/LLWU_P10<selection=GPIOC_6_PIN_SEL,PTC6><selection=LLWU_P10_PIN_SEL,PTC6>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTC6>
//     <3=> EXTRG_IN<selection=EXTRG_IN_PIN_SEL,PTC6>
//     <4=> I2S0_RX_BCLK<selection=I2S0_RX_BCLK_PIN_SEL,PTC6>
//     <5=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTC6>
//     <6=> I2S0_MCLK<selection=I2S0_MCLK_PIN_SEL,PTC6>
//     <7=> LCD_P26_fault<selection=LCD_P26_fault_PIN_SEL,PTC6>
//     <-2=> Default
#define PTC6_SIG_SEL         -2

// Signal mapping for PTC7 pin
//   <o> PTC7 [LCD_P27/CMP0_IN1, GPIOC_7, SPI0_MISO, audioUSB_SOF_OUT, I2S0_RX_FS, SPI0_MOSI, LCD_P27_fault]<name=PTC7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTC7 pin
//     <-2=> LCD_P27/CMP0_IN1 (reset default)<selection=LCD_P27_PIN_SEL,PTC7 (reset default)><selection=CMP0_IN1_PIN_SEL,PTC7 (reset default)>
//     <0=> LCD_P27/CMP0_IN1<selection=LCD_P27_PIN_SEL,PTC7><selection=CMP0_IN1_PIN_SEL,PTC7>
//     <1=> GPIOC_7<selection=GPIOC_7_PIN_SEL,PTC7>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTC7>
//     <3=> audioUSB_SOF_OUT<selection=audioUSB_SOF_OUT_PIN_SEL,PTC7>
//     <4=> I2S0_RX_FS<selection=I2S0_RX_FS_PIN_SEL,PTC7>
//     <5=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTC7>
//     <7=> LCD_P27_fault<selection=LCD_P27_fault_PIN_SEL,PTC7>
//     <-2=> Default
#define PTC7_SIG_SEL         -2

