podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o> PTD0 [LCD_P40, GPIOD_0, SPI0_SS, TPM0_CH0, FXIO0_D0, LCD_P40_fault]<name=PTD0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD0 pin
//     <-2=> LCD_P40 (reset default)<selection=LCD_P40_PIN_SEL,PTD0 (reset default)>
//     <0=> LCD_P40<selection=LCD_P40_PIN_SEL,PTD0>
//     <1=> GPIOD_0<selection=GPIOD_0_PIN_SEL,PTD0>
//     <2=> SPI0_SS<selection=SPI0_SS_PIN_SEL,PTD0>
//     <4=> TPM0_CH0<selection=TPM0_CH0_PIN_SEL,PTD0>
//     <6=> FXIO0_D0<selection=FXIO0_D0_PIN_SEL,PTD0>
//     <7=> LCD_P40_fault<selection=LCD_P40_fault_PIN_SEL,PTD0>
//     <-2=> Default
#define PTD0_SIG_SEL         -2

// Signal mapping for PTD1 pin
//   <o> PTD1 (Alias:ACCEL_INT2) [LCD_P41/ADC0_SE5b, GPIOD_1, SPI0_SCK, TPM0_CH1, FXIO0_D1, LCD_P41_fault]<name=PTD1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD1 pin
//     <-2=> LCD_P41/ADC0_SE5b (reset default)<selection=LCD_P41_PIN_SEL,PTD1 (Alias:ACCEL_INT2) (reset default)><selection=ADC0_SE5b_PIN_SEL,PTD1 (Alias:ACCEL_INT2) (reset default)>
//     <0=> LCD_P41/ADC0_SE5b<selection=LCD_P41_PIN_SEL,PTD1 (Alias:ACCEL_INT2)><selection=ADC0_SE5b_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <1=> GPIOD_1<selection=GPIOD_1_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <4=> TPM0_CH1<selection=TPM0_CH1_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <6=> FXIO0_D1<selection=FXIO0_D1_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <7=> LCD_P41_fault<selection=LCD_P41_fault_PIN_SEL,PTD1 (Alias:ACCEL_INT2)>
//     <-2=> Default
#define PTD1_SIG_SEL         -2

// Signal mapping for PTD2 pin
//   <o> PTD2 (Alias:D9) [LCD_P42, GPIOD_2, SPI0_MOSI, UART2_RX, TPM0_CH2, SPI0_MISO, FXIO0_D2, LCD_P42_fault]<name=PTD2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD2 pin
//     <-2=> LCD_P42 (reset default)<selection=LCD_P42_PIN_SEL,PTD2 (Alias:D9) (reset default)>
//     <0=> LCD_P42<selection=LCD_P42_PIN_SEL,PTD2 (Alias:D9)>
//     <1=> GPIOD_2<selection=GPIOD_2_PIN_SEL,PTD2 (Alias:D9)>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD2 (Alias:D9)>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD2 (Alias:D9)>
//     <4=> TPM0_CH2<selection=TPM0_CH2_PIN_SEL,PTD2 (Alias:D9)>
//     <5=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD2 (Alias:D9)>
//     <6=> FXIO0_D2<selection=FXIO0_D2_PIN_SEL,PTD2 (Alias:D9)>
//     <7=> LCD_P42_fault<selection=LCD_P42_fault_PIN_SEL,PTD2 (Alias:D9)>
//     <1=> Default
#define PTD2_SIG_SEL         1

// Signal mapping for PTD3 pin
//   <o> PTD3 (Alias:D2) [LCD_P43, GPIOD_3, SPI0_MISO, UART2_TX, TPM0_CH3, SPI0_MOSI, FXIO0_D3, LCD_P43_fault]<name=PTD3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD3 pin
//     <-2=> LCD_P43 (reset default)<selection=LCD_P43_PIN_SEL,PTD3 (Alias:D2) (reset default)>
//     <0=> LCD_P43<selection=LCD_P43_PIN_SEL,PTD3 (Alias:D2)>
//     <1=> GPIOD_3<selection=GPIOD_3_PIN_SEL,PTD3 (Alias:D2)>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD3 (Alias:D2)>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD3 (Alias:D2)>
//     <4=> TPM0_CH3<selection=TPM0_CH3_PIN_SEL,PTD3 (Alias:D2)>
//     <5=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD3 (Alias:D2)>
//     <6=> FXIO0_D3<selection=FXIO0_D3_PIN_SEL,PTD3 (Alias:D2)>
//     <7=> LCD_P43_fault<selection=LCD_P43_fault_PIN_SEL,PTD3 (Alias:D2)>
//     <4=> Default
#define PTD3_SIG_SEL         4

// Signal mapping for PTD4 pin
//   <o> PTD4 (Alias:D10) [LCD_P44, GPIOD_4/LLWU_P14, SPI1_SS, UART2_RX, TPM0_CH4, FXIO0_D4, LCD_P44_fault]<name=PTD4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD4 pin
//     <-2=> LCD_P44 (reset default)<selection=LCD_P44_PIN_SEL,PTD4 (Alias:D10) (reset default)>
//     <0=> LCD_P44<selection=LCD_P44_PIN_SEL,PTD4 (Alias:D10)>
//     <1=> GPIOD_4/LLWU_P14<selection=GPIOD_4_PIN_SEL,PTD4 (Alias:D10)><selection=LLWU_P14_PIN_SEL,PTD4 (Alias:D10)>
//     <2=> SPI1_SS<selection=SPI1_SS_PIN_SEL,PTD4 (Alias:D10)>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD4 (Alias:D10)>
//     <4=> TPM0_CH4<selection=TPM0_CH4_PIN_SEL,PTD4 (Alias:D10)>
//     <6=> FXIO0_D4<selection=FXIO0_D4_PIN_SEL,PTD4 (Alias:D10)>
//     <7=> LCD_P44_fault<selection=LCD_P44_fault_PIN_SEL,PTD4 (Alias:D10)>
//     <4=> Default
#define PTD4_SIG_SEL         4

// Signal mapping for PTD5 pin
//   <o> PTD5 (Alias:D13, LED_GREEN) [LCD_P45/ADC0_SE6b, GPIOD_5, SPI1_SCK, UART2_TX, TPM0_CH5, FXIO0_D5, LCD_P45_fault]<name=PTD5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD5 pin
//     <-2=> LCD_P45/ADC0_SE6b (reset default)<selection=LCD_P45_PIN_SEL,PTD5 (Alias:D13, LED_GREEN) (reset default)><selection=ADC0_SE6b_PIN_SEL,PTD5 (Alias:D13, LED_GREEN) (reset default)>
//     <0=> LCD_P45/ADC0_SE6b<selection=LCD_P45_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)><selection=ADC0_SE6b_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <1=> GPIOD_5<selection=GPIOD_5_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <4=> TPM0_CH5<selection=TPM0_CH5_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <6=> FXIO0_D5<selection=FXIO0_D5_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <7=> LCD_P45_fault<selection=LCD_P45_fault_PIN_SEL,PTD5 (Alias:D13, LED_GREEN)>
//     <4=> Default
#define PTD5_SIG_SEL         4

// Signal mapping for PTD6 pin
//   <o> PTD6 (Alias:D11) [LCD_P46/ADC0_SE7b, GPIOD_6/LLWU_P15, SPI1_MOSI, LPUART0_RX, SPI1_MISO, FXIO0_D6, LCD_P46_fault]<name=PTD6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD6 pin
//     <-2=> LCD_P46/ADC0_SE7b (reset default)<selection=LCD_P46_PIN_SEL,PTD6 (Alias:D11) (reset default)><selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:D11) (reset default)>
//     <0=> LCD_P46/ADC0_SE7b<selection=LCD_P46_PIN_SEL,PTD6 (Alias:D11)><selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:D11)>
//     <1=> GPIOD_6/LLWU_P15<selection=GPIOD_6_PIN_SEL,PTD6 (Alias:D11)><selection=LLWU_P15_PIN_SEL,PTD6 (Alias:D11)>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD6 (Alias:D11)>
//     <3=> LPUART0_RX<selection=LPUART0_RX_PIN_SEL,PTD6 (Alias:D11)>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD6 (Alias:D11)>
//     <6=> FXIO0_D6<selection=FXIO0_D6_PIN_SEL,PTD6 (Alias:D11)>
//     <7=> LCD_P46_fault<selection=LCD_P46_fault_PIN_SEL,PTD6 (Alias:D11)>
//     <-2=> Default
#define PTD6_SIG_SEL         -2

// Signal mapping for PTD7 pin
//   <o> PTD7 [LCD_P47, GPIOD_7, SPI1_MISO, LPUART0_TX, SPI1_MOSI, FXIO0_D6, LCD_P47_fault]<name=PTD7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD7 pin
//     <-2=> LCD_P47 (reset default)<selection=LCD_P47_PIN_SEL,PTD7 (reset default)>
//     <0=> LCD_P47<selection=LCD_P47_PIN_SEL,PTD7>
//     <1=> GPIOD_7<selection=GPIOD_7_PIN_SEL,PTD7>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD7>
//     <3=> LPUART0_TX<selection=LPUART0_TX_PIN_SEL,PTD7>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD7>
//     <6=> FXIO0_D6<selection=FXIO0_D6_PIN_SEL,PTD7>
//     <7=> LCD_P47_fault<selection=LCD_P47_fault_PIN_SEL,PTD7>
//     <-2=> Default
#define PTD7_SIG_SEL         -2

