podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// </h>

// <h> Analogue Comparator (CMP0)

// Pin Mapping for CMP0_IN0 signal
//   <o> CMP0_IN0 [PTC6]<name=CMP0_IN0_PIN_SEL>
//   <i> Shows which pin CMP0_IN0 is mapped to
//     <0=> Disabled
//     <1=> PTC6 (reset default)<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0 (reset default)>
//     <2=> PTC6<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0>
//     <1=> Default
#define CMP0_IN0_PIN_SEL     1
#if (CMP0_IN0_PIN_SEL == 2)
#define CMP0_IN0_GPIO        USBDM::GpioC<6>
#define CMP0_IN0_FN          0
#endif

// Pin Mapping for CMP0_IN1 signal
//   <o> CMP0_IN1 [PTC7]<name=CMP0_IN1_PIN_SEL>
//   <i> Shows which pin CMP0_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTC7 (reset default)<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1 (reset default)>
//     <2=> PTC7<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1>
//     <1=> Default
#define CMP0_IN1_PIN_SEL     1
#if (CMP0_IN1_PIN_SEL == 2)
#define CMP0_IN1_GPIO        USBDM::GpioC<7>
#define CMP0_IN1_FN          0
#endif

// Pin Mapping for CMP0_IN4 signal
//   <o> CMP0_IN4 [PTE30]<name=CMP0_IN4_PIN_SEL>
//   <i> Shows which pin CMP0_IN4 is mapped to
//     <0=> Disabled
//     <1=> PTE30 (Alias:D7) (reset default)<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4 (reset default)>
//     <2=> PTE30 (Alias:D7)<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4>
//     <0=> Default
#define CMP0_IN4_PIN_SEL     0
#if (CMP0_IN4_PIN_SEL == 2)
#define CMP0_IN4_GPIO        USBDM::GpioE<30>
#define CMP0_IN4_FN          0
#endif

// Pin Mapping for CMP0_IN5 signal
//   <o> CMP0_IN5 [PTE29]<name=CMP0_IN5_PIN_SEL>
//   <i> Shows which pin CMP0_IN5 is mapped to
//     <0=> Disabled
//     <1=> PTE29 (Alias:D6) (reset default)<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b (reset default)>
//     <2=> PTE29 (Alias:D6)<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b>
//     <0=> Default
#define CMP0_IN5_PIN_SEL     0
#if (CMP0_IN5_PIN_SEL == 2)
#define CMP0_IN5_GPIO        USBDM::GpioE<29>
#define CMP0_IN5_FN          0
#endif

// Pin Mapping for CMP0_OUT signal
//   <o> CMP0_OUT [PTC0, PTE0, PTC5]<name=CMP0_OUT_PIN_SEL>
//   <i> Shows which pin CMP0_OUT is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,CMP0_OUT>
//     <2=> PTE0 (Alias:D14)<selection=PTE0_SIG_SEL,CMP0_OUT>
//     <3=> PTC5 (Alias:ACCEL_INT1, MAG_INT)<selection=PTC5_SIG_SEL,CMP0_OUT>
//     <0=> Default
#define CMP0_OUT_PIN_SEL     0
#if (CMP0_OUT_PIN_SEL == 1)
#define CMP0_OUT_GPIO        USBDM::GpioC<0>
#define CMP0_OUT_FN          5
#elif (CMP0_OUT_PIN_SEL == 2)
#define CMP0_OUT_GPIO        USBDM::GpioE<0>
#define CMP0_OUT_FN          5
#elif (CMP0_OUT_PIN_SEL == 3)
#define CMP0_OUT_GPIO        USBDM::GpioC<5>
#define CMP0_OUT_FN          6
#endif

// </h>

// <h> Digital to Analogue (DAC0)

// Pin Mapping for DAC0_OUT signal
//   <o> DAC0_OUT [PTE30]<name=DAC0_OUT_PIN_SEL>
//   <i> Shows which pin DAC0_OUT is mapped to
//     <0=> Disabled
//     <1=> PTE30 (Alias:D7) (reset default)<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4 (reset default)>
//     <2=> PTE30 (Alias:D7)<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4>
//     <0=> Default
#define DAC0_OUT_PIN_SEL     0
#if (DAC0_OUT_PIN_SEL == 2)
#define DAC0_OUT_GPIO        USBDM::GpioE<30>
#define DAC0_OUT_FN          0
#endif

// </h>

// <h> Flexbus (FXIO0)

// Pin Mapping for FXIO0_D0 signal
//   <o> FXIO0_D0 [PTD0]<name=FXIO0_D0_PIN_SEL>
//   <i> Shows which pin FXIO0_D0 is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,FXIO0_D0>
//     <0=> Default
#define FXIO0_D0_PIN_SEL     0
#if (FXIO0_D0_PIN_SEL == 1)
#define FXIO0_D0_GPIO        USBDM::GpioD<0>
#define FXIO0_D0_FN          6
#endif

// Pin Mapping for FXIO0_D1 signal
//   <o> FXIO0_D1 [PTD1]<name=FXIO0_D1_PIN_SEL>
//   <i> Shows which pin FXIO0_D1 is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:ACCEL_INT2)<selection=PTD1_SIG_SEL,FXIO0_D1>
//     <0=> Default
#define FXIO0_D1_PIN_SEL     0
#if (FXIO0_D1_PIN_SEL == 1)
#define FXIO0_D1_GPIO        USBDM::GpioD<1>
#define FXIO0_D1_FN          6
#endif

// Pin Mapping for FXIO0_D2 signal
//   <o> FXIO0_D2 [PTD2]<name=FXIO0_D2_PIN_SEL>
//   <i> Shows which pin FXIO0_D2 is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D9)<selection=PTD2_SIG_SEL,FXIO0_D2>
//     <0=> Default
#define FXIO0_D2_PIN_SEL     0
#if (FXIO0_D2_PIN_SEL == 1)
#define FXIO0_D2_GPIO        USBDM::GpioD<2>
#define FXIO0_D2_FN          6
#endif

// Pin Mapping for FXIO0_D3 signal
//   <o> FXIO0_D3 [PTD3]<name=FXIO0_D3_PIN_SEL>
//   <i> Shows which pin FXIO0_D3 is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D2)<selection=PTD3_SIG_SEL,FXIO0_D3>
//     <0=> Default
#define FXIO0_D3_PIN_SEL     0
#if (FXIO0_D3_PIN_SEL == 1)
#define FXIO0_D3_GPIO        USBDM::GpioD<3>
#define FXIO0_D3_FN          6
#endif

// Pin Mapping for FXIO0_D4 signal
//   <o> FXIO0_D4 [PTD4, PTE20]<name=FXIO0_D4_PIN_SEL>
//   <i> Shows which pin FXIO0_D4 is mapped to
//     <0=> Disabled
//     <1=> PTD4 (Alias:D10)<selection=PTD4_SIG_SEL,FXIO0_D4>
//     <2=> PTE20<selection=PTE20_SIG_SEL,FXIO0_D4>
//     <0=> Default
#define FXIO0_D4_PIN_SEL     0
#if (FXIO0_D4_PIN_SEL == 1)
#define FXIO0_D4_GPIO        USBDM::GpioD<4>
#define FXIO0_D4_FN          6
#elif (FXIO0_D4_PIN_SEL == 2)
#define FXIO0_D4_GPIO        USBDM::GpioE<20>
#define FXIO0_D4_FN          6
#endif

// Pin Mapping for FXIO0_D5 signal
//   <o> FXIO0_D5 [PTD5, PTE21]<name=FXIO0_D5_PIN_SEL>
//   <i> Shows which pin FXIO0_D5 is mapped to
//     <0=> Disabled
//     <1=> PTD5 (Alias:D13, LED_GREEN)<selection=PTD5_SIG_SEL,FXIO0_D5>
//     <2=> PTE21<selection=PTE21_SIG_SEL,FXIO0_D5>
//     <0=> Default
#define FXIO0_D5_PIN_SEL     0
#if (FXIO0_D5_PIN_SEL == 1)
#define FXIO0_D5_GPIO        USBDM::GpioD<5>
#define FXIO0_D5_FN          6
#elif (FXIO0_D5_PIN_SEL == 2)
#define FXIO0_D5_GPIO        USBDM::GpioE<21>
#define FXIO0_D5_FN          6
#endif

// Pin Mapping for FXIO0_D6 signal
//   <o> FXIO0_D6 [PTD6, PTD7, PTE22]<name=FXIO0_D6_PIN_SEL>
//   <i> Shows which pin FXIO0_D6 is mapped to
//     <0=> Disabled
//     <1=> PTD6 (Alias:D11)<selection=PTD6_SIG_SEL,FXIO0_D6>
//     <2=> PTD7<selection=PTD7_SIG_SEL,FXIO0_D6>
//     <3=> PTE22 (Alias:LIGHT_SENS)<selection=PTE22_SIG_SEL,FXIO0_D6>
//     <0=> Default
#define FXIO0_D6_PIN_SEL     0
#if (FXIO0_D6_PIN_SEL == 1)
#define FXIO0_D6_GPIO        USBDM::GpioD<6>
#define FXIO0_D6_FN          6
#elif (FXIO0_D6_PIN_SEL == 2)
#define FXIO0_D6_GPIO        USBDM::GpioD<7>
#define FXIO0_D6_FN          6
#elif (FXIO0_D6_PIN_SEL == 3)
#define FXIO0_D6_GPIO        USBDM::GpioE<22>
#define FXIO0_D6_FN          6
#endif

// Pin Mapping for FXIO0_D7 signal
//   <o> FXIO0_D7 [PTE23]<name=FXIO0_D7_PIN_SEL>
//   <i> Shows which pin FXIO0_D7 is mapped to
//     <0=> Disabled
//     <1=> PTE23<selection=PTE23_SIG_SEL,FXIO0_D7>
//     <0=> Default
#define FXIO0_D7_PIN_SEL     0
#if (FXIO0_D7_PIN_SEL == 1)
#define FXIO0_D7_GPIO        USBDM::GpioE<23>
#define FXIO0_D7_FN          6
#endif

