podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// Pin Mapping for LCD_P2_fault signal
//   <o> LCD_P2_fault [PTB2]<name=LCD_P2_fault_PIN_SEL>
//   <i> Shows which pin LCD_P2_fault is mapped to
//     <0=> Disabled
//     <1=> PTB2 (Alias:A2)<selection=PTB2_SIG_SEL,LCD_P2_fault>
//     <0=> Default
#define LCD_P2_fault_PIN_SEL 0
#if (LCD_P2_fault_PIN_SEL == 1)
#define LCD_P2_fault_GPIO    USBDM::GpioB<2>
#define LCD_P2_fault_FN      7
#endif

// Pin Mapping for LCD_P3 signal
//   <o> LCD_P3 [PTB3]<name=LCD_P3_PIN_SEL>
//   <i> Shows which pin LCD_P3 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (Alias:A3) (reset default)<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13 (reset default)>
//     <2=> PTB3 (Alias:A3)<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13>
//     <2=> Default
#define LCD_P3_PIN_SEL       2
#if (LCD_P3_PIN_SEL == 2)
#define LCD_P3_GPIO          USBDM::GpioB<3>
#define LCD_P3_FN            0
#endif

// Pin Mapping for LCD_P3_fault signal
//   <o> LCD_P3_fault [PTB3]<name=LCD_P3_fault_PIN_SEL>
//   <i> Shows which pin LCD_P3_fault is mapped to
//     <0=> Disabled
//     <1=> PTB3 (Alias:A3)<selection=PTB3_SIG_SEL,LCD_P3_fault>
//     <0=> Default
#define LCD_P3_fault_PIN_SEL 0
#if (LCD_P3_fault_PIN_SEL == 1)
#define LCD_P3_fault_GPIO    USBDM::GpioB<3>
#define LCD_P3_fault_FN      7
#endif

// Pin Mapping for LCD_P12 signal
//   <o> LCD_P12 [PTB16]<name=LCD_P12_PIN_SEL>
//   <i> Shows which pin LCD_P12 is mapped to
//     <0=> Disabled
//     <1=> PTB16 (reset default)<selection=PTB16_SIG_SEL,LCD_P12 (reset default)>
//     <2=> PTB16<selection=PTB16_SIG_SEL,LCD_P12>
//     <1=> Default
#define LCD_P12_PIN_SEL      1
#if (LCD_P12_PIN_SEL == 2)
#define LCD_P12_GPIO         USBDM::GpioB<16>
#define LCD_P12_FN           0
#endif

// Pin Mapping for LCD_P12_fault signal
//   <o> LCD_P12_fault [PTB16]<name=LCD_P12_fault_PIN_SEL>
//   <i> Shows which pin LCD_P12_fault is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,LCD_P12_fault>
//     <0=> Default
#define LCD_P12_fault_PIN_SEL 0
#if (LCD_P12_fault_PIN_SEL == 1)
#define LCD_P12_fault_GPIO   USBDM::GpioB<16>
#define LCD_P12_fault_FN     7
#endif

// Pin Mapping for LCD_P13 signal
//   <o> LCD_P13 [PTB17]<name=LCD_P13_PIN_SEL>
//   <i> Shows which pin LCD_P13 is mapped to
//     <0=> Disabled
//     <1=> PTB17 (reset default)<selection=PTB17_SIG_SEL,LCD_P13 (reset default)>
//     <2=> PTB17<selection=PTB17_SIG_SEL,LCD_P13>
//     <1=> Default
#define LCD_P13_PIN_SEL      1
#if (LCD_P13_PIN_SEL == 2)
#define LCD_P13_GPIO         USBDM::GpioB<17>
#define LCD_P13_FN           0
#endif

// Pin Mapping for LCD_P13_fault signal
//   <o> LCD_P13_fault [PTB17]<name=LCD_P13_fault_PIN_SEL>
//   <i> Shows which pin LCD_P13_fault is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,LCD_P13_fault>
//     <0=> Default
#define LCD_P13_fault_PIN_SEL 0
#if (LCD_P13_fault_PIN_SEL == 1)
#define LCD_P13_fault_GPIO   USBDM::GpioB<17>
#define LCD_P13_fault_FN     7
#endif

// Pin Mapping for LCD_P14 signal
//   <o> LCD_P14 [PTB18]<name=LCD_P14_PIN_SEL>
//   <i> Shows which pin LCD_P14 is mapped to
//     <0=> Disabled
//     <1=> PTB18 (reset default)<selection=PTB18_SIG_SEL,LCD_P14 (reset default)>
//     <2=> PTB18<selection=PTB18_SIG_SEL,LCD_P14>
//     <1=> Default
#define LCD_P14_PIN_SEL      1
#if (LCD_P14_PIN_SEL == 2)
#define LCD_P14_GPIO         USBDM::GpioB<18>
#define LCD_P14_FN           0
#endif

// Pin Mapping for LCD_P14_fault signal
//   <o> LCD_P14_fault [PTB18]<name=LCD_P14_fault_PIN_SEL>
//   <i> Shows which pin LCD_P14_fault is mapped to
//     <0=> Disabled
//     <1=> PTB18<selection=PTB18_SIG_SEL,LCD_P14_fault>
//     <0=> Default
#define LCD_P14_fault_PIN_SEL 0
#if (LCD_P14_fault_PIN_SEL == 1)
#define LCD_P14_fault_GPIO   USBDM::GpioB<18>
#define LCD_P14_fault_FN     7
#endif

// Pin Mapping for LCD_P15 signal
//   <o> LCD_P15 [PTB19]<name=LCD_P15_PIN_SEL>
//   <i> Shows which pin LCD_P15 is mapped to
//     <0=> Disabled
//     <1=> PTB19 (reset default)<selection=PTB19_SIG_SEL,LCD_P15 (reset default)>
//     <2=> PTB19<selection=PTB19_SIG_SEL,LCD_P15>
//     <1=> Default
#define LCD_P15_PIN_SEL      1
#if (LCD_P15_PIN_SEL == 2)
#define LCD_P15_GPIO         USBDM::GpioB<19>
#define LCD_P15_FN           0
#endif

// Pin Mapping for LCD_P15_fault signal
//   <o> LCD_P15_fault [PTB19]<name=LCD_P15_fault_PIN_SEL>
//   <i> Shows which pin LCD_P15_fault is mapped to
//     <0=> Disabled
//     <1=> PTB19<selection=PTB19_SIG_SEL,LCD_P15_fault>
//     <0=> Default
#define LCD_P15_fault_PIN_SEL 0
#if (LCD_P15_fault_PIN_SEL == 1)
#define LCD_P15_fault_GPIO   USBDM::GpioB<19>
#define LCD_P15_fault_FN     7
#endif

// Pin Mapping for LCD_P20 signal
//   <o> LCD_P20 [PTC0]<name=LCD_P20_PIN_SEL>
//   <i> Shows which pin LCD_P20 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14>
//     <1=> Default
#define LCD_P20_PIN_SEL      1
#if (LCD_P20_PIN_SEL == 2)
#define LCD_P20_GPIO         USBDM::GpioC<0>
#define LCD_P20_FN           0
#endif

// Pin Mapping for LCD_P20_fault signal
//   <o> LCD_P20_fault [PTC0]<name=LCD_P20_fault_PIN_SEL>
//   <i> Shows which pin LCD_P20_fault is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,LCD_P20_fault>
//     <0=> Default
#define LCD_P20_fault_PIN_SEL 0
#if (LCD_P20_fault_PIN_SEL == 1)
#define LCD_P20_fault_GPIO   USBDM::GpioC<0>
#define LCD_P20_fault_FN     7
#endif

// Pin Mapping for LCD_P21 signal
//   <o> LCD_P21 [PTC1]<name=LCD_P21_PIN_SEL>
//   <i> Shows which pin LCD_P21 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (Alias:A5) (reset default)<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15 (reset default)>
//     <2=> PTC1 (Alias:A5)<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15>
//     <2=> Default
#define LCD_P21_PIN_SEL      2
#if (LCD_P21_PIN_SEL == 2)
#define LCD_P21_GPIO         USBDM::GpioC<1>
#define LCD_P21_FN           0
#endif

// Pin Mapping for LCD_P21_fault signal
//   <o> LCD_P21_fault [PTC1]<name=LCD_P21_fault_PIN_SEL>
//   <i> Shows which pin LCD_P21_fault is mapped to
//     <0=> Disabled
//     <1=> PTC1 (Alias:A5)<selection=PTC1_SIG_SEL,LCD_P21_fault>
//     <0=> Default
#define LCD_P21_fault_PIN_SEL 0
#if (LCD_P21_fault_PIN_SEL == 1)
#define LCD_P21_fault_GPIO   USBDM::GpioC<1>
#define LCD_P21_fault_FN     7
#endif

// Pin Mapping for LCD_P22 signal
//   <o> LCD_P22 [PTC2]<name=LCD_P22_PIN_SEL>
//   <i> Shows which pin LCD_P22 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (Alias:A4) (reset default)<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11 (reset default)>
//     <2=> PTC2 (Alias:A4)<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11>
//     <2=> Default
#define LCD_P22_PIN_SEL      2
#if (LCD_P22_PIN_SEL == 2)
#define LCD_P22_GPIO         USBDM::GpioC<2>
#define LCD_P22_FN           0
#endif

// Pin Mapping for LCD_P22_fault signal
//   <o> LCD_P22_fault [PTC2]<name=LCD_P22_fault_PIN_SEL>
//   <i> Shows which pin LCD_P22_fault is mapped to
//     <0=> Disabled
//     <1=> PTC2 (Alias:A4)<selection=PTC2_SIG_SEL,LCD_P22_fault>
//     <0=> Default
#define LCD_P22_fault_PIN_SEL 0
#if (LCD_P22_fault_PIN_SEL == 1)
#define LCD_P22_fault_GPIO   USBDM::GpioC<2>
#define LCD_P22_fault_FN     7
#endif

// Pin Mapping for LCD_P23 signal
//   <o> LCD_P23 [PTC3]<name=LCD_P23_PIN_SEL>
//   <i> Shows which pin LCD_P23 is mapped to
//     <0=> Disabled
//     <1=> PTC3 (reset default)<selection=PTC3_SIG_SEL,LCD_P23 (reset default)>
//     <2=> PTC3<selection=PTC3_SIG_SEL,LCD_P23>
//     <1=> Default
#define LCD_P23_PIN_SEL      1
#if (LCD_P23_PIN_SEL == 2)
#define LCD_P23_GPIO         USBDM::GpioC<3>
#define LCD_P23_FN           0
#endif

