podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// Pin Mapping for LCD_P23_fault signal
//   <o> LCD_P23_fault [PTC3]<name=LCD_P23_fault_PIN_SEL>
//   <i> Shows which pin LCD_P23_fault is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD_P23_fault>
//     <0=> Default
#define LCD_P23_fault_PIN_SEL 0
#if (LCD_P23_fault_PIN_SEL == 1)
#define LCD_P23_fault_GPIO   USBDM::GpioC<3>
#define LCD_P23_fault_FN     7
#endif

// Pin Mapping for LCD_P24 signal
//   <o> LCD_P24 [PTC4]<name=LCD_P24_PIN_SEL>
//   <i> Shows which pin LCD_P24 is mapped to
//     <0=> Disabled
//     <1=> PTC4 (reset default)<selection=PTC4_SIG_SEL,LCD_P24 (reset default)>
//     <2=> PTC4<selection=PTC4_SIG_SEL,LCD_P24>
//     <1=> Default
#define LCD_P24_PIN_SEL      1
#if (LCD_P24_PIN_SEL == 2)
#define LCD_P24_GPIO         USBDM::GpioC<4>
#define LCD_P24_FN           0
#endif

// Pin Mapping for LCD_P24_fault signal
//   <o> LCD_P24_fault [PTC4]<name=LCD_P24_fault_PIN_SEL>
//   <i> Shows which pin LCD_P24_fault is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,LCD_P24_fault>
//     <0=> Default
#define LCD_P24_fault_PIN_SEL 0
#if (LCD_P24_fault_PIN_SEL == 1)
#define LCD_P24_fault_GPIO   USBDM::GpioC<4>
#define LCD_P24_fault_FN     7
#endif

// Pin Mapping for LCD_P25 signal
//   <o> LCD_P25 [PTC5]<name=LCD_P25_PIN_SEL>
//   <i> Shows which pin LCD_P25 is mapped to
//     <0=> Disabled
//     <1=> PTC5 (Alias:ACCEL_INT1, MAG_INT) (reset default)<selection=PTC5_SIG_SEL,LCD_P25 (reset default)>
//     <2=> PTC5 (Alias:ACCEL_INT1, MAG_INT)<selection=PTC5_SIG_SEL,LCD_P25>
//     <1=> Default
#define LCD_P25_PIN_SEL      1
#if (LCD_P25_PIN_SEL == 2)
#define LCD_P25_GPIO         USBDM::GpioC<5>
#define LCD_P25_FN           0
#endif

// Pin Mapping for LCD_P25_fault signal
//   <o> LCD_P25_fault [PTC5]<name=LCD_P25_fault_PIN_SEL>
//   <i> Shows which pin LCD_P25_fault is mapped to
//     <0=> Disabled
//     <1=> PTC5 (Alias:ACCEL_INT1, MAG_INT)<selection=PTC5_SIG_SEL,LCD_P25_fault>
//     <0=> Default
#define LCD_P25_fault_PIN_SEL 0
#if (LCD_P25_fault_PIN_SEL == 1)
#define LCD_P25_fault_GPIO   USBDM::GpioC<5>
#define LCD_P25_fault_FN     7
#endif

// Pin Mapping for LCD_P26 signal
//   <o> LCD_P26 [PTC6]<name=LCD_P26_PIN_SEL>
//   <i> Shows which pin LCD_P26 is mapped to
//     <0=> Disabled
//     <1=> PTC6 (reset default)<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0 (reset default)>
//     <2=> PTC6<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0>
//     <1=> Default
#define LCD_P26_PIN_SEL      1
#if (LCD_P26_PIN_SEL == 2)
#define LCD_P26_GPIO         USBDM::GpioC<6>
#define LCD_P26_FN           0
#endif

// Pin Mapping for LCD_P26_fault signal
//   <o> LCD_P26_fault [PTC6]<name=LCD_P26_fault_PIN_SEL>
//   <i> Shows which pin LCD_P26_fault is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,LCD_P26_fault>
//     <0=> Default
#define LCD_P26_fault_PIN_SEL 0
#if (LCD_P26_fault_PIN_SEL == 1)
#define LCD_P26_fault_GPIO   USBDM::GpioC<6>
#define LCD_P26_fault_FN     7
#endif

// Pin Mapping for LCD_P27 signal
//   <o> LCD_P27 [PTC7]<name=LCD_P27_PIN_SEL>
//   <i> Shows which pin LCD_P27 is mapped to
//     <0=> Disabled
//     <1=> PTC7 (reset default)<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1 (reset default)>
//     <2=> PTC7<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1>
//     <1=> Default
#define LCD_P27_PIN_SEL      1
#if (LCD_P27_PIN_SEL == 2)
#define LCD_P27_GPIO         USBDM::GpioC<7>
#define LCD_P27_FN           0
#endif

// Pin Mapping for LCD_P27_fault signal
//   <o> LCD_P27_fault [PTC7]<name=LCD_P27_fault_PIN_SEL>
//   <i> Shows which pin LCD_P27_fault is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,LCD_P27_fault>
//     <0=> Default
#define LCD_P27_fault_PIN_SEL 0
#if (LCD_P27_fault_PIN_SEL == 1)
#define LCD_P27_fault_GPIO   USBDM::GpioC<7>
#define LCD_P27_fault_FN     7
#endif

// Pin Mapping for LCD_P40 signal
//   <o> LCD_P40 [PTD0]<name=LCD_P40_PIN_SEL>
//   <i> Shows which pin LCD_P40 is mapped to
//     <0=> Disabled
//     <1=> PTD0 (reset default)<selection=PTD0_SIG_SEL,LCD_P40 (reset default)>
//     <2=> PTD0<selection=PTD0_SIG_SEL,LCD_P40>
//     <1=> Default
#define LCD_P40_PIN_SEL      1
#if (LCD_P40_PIN_SEL == 2)
#define LCD_P40_GPIO         USBDM::GpioD<0>
#define LCD_P40_FN           0
#endif

// Pin Mapping for LCD_P40_fault signal
//   <o> LCD_P40_fault [PTD0]<name=LCD_P40_fault_PIN_SEL>
//   <i> Shows which pin LCD_P40_fault is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,LCD_P40_fault>
//     <0=> Default
#define LCD_P40_fault_PIN_SEL 0
#if (LCD_P40_fault_PIN_SEL == 1)
#define LCD_P40_fault_GPIO   USBDM::GpioD<0>
#define LCD_P40_fault_FN     7
#endif

// Pin Mapping for LCD_P41 signal
//   <o> LCD_P41 [PTD1]<name=LCD_P41_PIN_SEL>
//   <i> Shows which pin LCD_P41 is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:ACCEL_INT2) (reset default)<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b (reset default)>
//     <2=> PTD1 (Alias:ACCEL_INT2)<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b>
//     <1=> Default
#define LCD_P41_PIN_SEL      1
#if (LCD_P41_PIN_SEL == 2)
#define LCD_P41_GPIO         USBDM::GpioD<1>
#define LCD_P41_FN           0
#endif

// Pin Mapping for LCD_P41_fault signal
//   <o> LCD_P41_fault [PTD1]<name=LCD_P41_fault_PIN_SEL>
//   <i> Shows which pin LCD_P41_fault is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:ACCEL_INT2)<selection=PTD1_SIG_SEL,LCD_P41_fault>
//     <0=> Default
#define LCD_P41_fault_PIN_SEL 0
#if (LCD_P41_fault_PIN_SEL == 1)
#define LCD_P41_fault_GPIO   USBDM::GpioD<1>
#define LCD_P41_fault_FN     7
#endif

// Pin Mapping for LCD_P42 signal
//   <o> LCD_P42 [PTD2]<name=LCD_P42_PIN_SEL>
//   <i> Shows which pin LCD_P42 is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D9) (reset default)<selection=PTD2_SIG_SEL,LCD_P42 (reset default)>
//     <2=> PTD2 (Alias:D9)<selection=PTD2_SIG_SEL,LCD_P42>
//     <0=> Default
#define LCD_P42_PIN_SEL      0
#if (LCD_P42_PIN_SEL == 2)
#define LCD_P42_GPIO         USBDM::GpioD<2>
#define LCD_P42_FN           0
#endif

