podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL43Z4.h
// Pin Mapping for LCD_P42_fault signal
//   <o> LCD_P42_fault [PTD2]<name=LCD_P42_fault_PIN_SEL>
//   <i> Shows which pin LCD_P42_fault is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D9)<selection=PTD2_SIG_SEL,LCD_P42_fault>
//     <0=> Default
#define LCD_P42_fault_PIN_SEL 0
#if (LCD_P42_fault_PIN_SEL == 1)
#define LCD_P42_fault_GPIO   USBDM::GpioD<2>
#define LCD_P42_fault_FN     7
#endif

// Pin Mapping for LCD_P43 signal
//   <o> LCD_P43 [PTD3]<name=LCD_P43_PIN_SEL>
//   <i> Shows which pin LCD_P43 is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D2) (reset default)<selection=PTD3_SIG_SEL,LCD_P43 (reset default)>
//     <2=> PTD3 (Alias:D2)<selection=PTD3_SIG_SEL,LCD_P43>
//     <0=> Default
#define LCD_P43_PIN_SEL      0
#if (LCD_P43_PIN_SEL == 2)
#define LCD_P43_GPIO         USBDM::GpioD<3>
#define LCD_P43_FN           0
#endif

// Pin Mapping for LCD_P43_fault signal
//   <o> LCD_P43_fault [PTD3]<name=LCD_P43_fault_PIN_SEL>
//   <i> Shows which pin LCD_P43_fault is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D2)<selection=PTD3_SIG_SEL,LCD_P43_fault>
//     <0=> Default
#define LCD_P43_fault_PIN_SEL 0
#if (LCD_P43_fault_PIN_SEL == 1)
#define LCD_P43_fault_GPIO   USBDM::GpioD<3>
#define LCD_P43_fault_FN     7
#endif

// Pin Mapping for LCD_P44 signal
//   <o> LCD_P44 [PTD4]<name=LCD_P44_PIN_SEL>
//   <i> Shows which pin LCD_P44 is mapped to
//     <0=> Disabled
//     <1=> PTD4 (Alias:D10) (reset default)<selection=PTD4_SIG_SEL,LCD_P44 (reset default)>
//     <2=> PTD4 (Alias:D10)<selection=PTD4_SIG_SEL,LCD_P44>
//     <0=> Default
#define LCD_P44_PIN_SEL      0
#if (LCD_P44_PIN_SEL == 2)
#define LCD_P44_GPIO         USBDM::GpioD<4>
#define LCD_P44_FN           0
#endif

// Pin Mapping for LCD_P44_fault signal
//   <o> LCD_P44_fault [PTD4]<name=LCD_P44_fault_PIN_SEL>
//   <i> Shows which pin LCD_P44_fault is mapped to
//     <0=> Disabled
//     <1=> PTD4 (Alias:D10)<selection=PTD4_SIG_SEL,LCD_P44_fault>
//     <0=> Default
#define LCD_P44_fault_PIN_SEL 0
#if (LCD_P44_fault_PIN_SEL == 1)
#define LCD_P44_fault_GPIO   USBDM::GpioD<4>
#define LCD_P44_fault_FN     7
#endif

// Pin Mapping for LCD_P45 signal
//   <o> LCD_P45 [PTD5]<name=LCD_P45_PIN_SEL>
//   <i> Shows which pin LCD_P45 is mapped to
//     <0=> Disabled
//     <1=> PTD5 (Alias:D13, LED_GREEN) (reset default)<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b (reset default)>
//     <2=> PTD5 (Alias:D13, LED_GREEN)<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b>
//     <0=> Default
#define LCD_P45_PIN_SEL      0
#if (LCD_P45_PIN_SEL == 2)
#define LCD_P45_GPIO         USBDM::GpioD<5>
#define LCD_P45_FN           0
#endif

// Pin Mapping for LCD_P45_fault signal
//   <o> LCD_P45_fault [PTD5]<name=LCD_P45_fault_PIN_SEL>
//   <i> Shows which pin LCD_P45_fault is mapped to
//     <0=> Disabled
//     <1=> PTD5 (Alias:D13, LED_GREEN)<selection=PTD5_SIG_SEL,LCD_P45_fault>
//     <0=> Default
#define LCD_P45_fault_PIN_SEL 0
#if (LCD_P45_fault_PIN_SEL == 1)
#define LCD_P45_fault_GPIO   USBDM::GpioD<5>
#define LCD_P45_fault_FN     7
#endif

// Pin Mapping for LCD_P46 signal
//   <o> LCD_P46 [PTD6]<name=LCD_P46_PIN_SEL>
//   <i> Shows which pin LCD_P46 is mapped to
//     <0=> Disabled
//     <1=> PTD6 (Alias:D11) (reset default)<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b (reset default)>
//     <2=> PTD6 (Alias:D11)<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b>
//     <1=> Default
#define LCD_P46_PIN_SEL      1
#if (LCD_P46_PIN_SEL == 2)
#define LCD_P46_GPIO         USBDM::GpioD<6>
#define LCD_P46_FN           0
#endif

// Pin Mapping for LCD_P46_fault signal
//   <o> LCD_P46_fault [PTD6]<name=LCD_P46_fault_PIN_SEL>
//   <i> Shows which pin LCD_P46_fault is mapped to
//     <0=> Disabled
//     <1=> PTD6 (Alias:D11)<selection=PTD6_SIG_SEL,LCD_P46_fault>
//     <0=> Default
#define LCD_P46_fault_PIN_SEL 0
#if (LCD_P46_fault_PIN_SEL == 1)
#define LCD_P46_fault_GPIO   USBDM::GpioD<6>
#define LCD_P46_fault_FN     7
#endif

// Pin Mapping for LCD_P47 signal
//   <o> LCD_P47 [PTD7]<name=LCD_P47_PIN_SEL>
//   <i> Shows which pin LCD_P47 is mapped to
//     <0=> Disabled
//     <1=> PTD7 (reset default)<selection=PTD7_SIG_SEL,LCD_P47 (reset default)>
//     <2=> PTD7<selection=PTD7_SIG_SEL,LCD_P47>
//     <1=> Default
#define LCD_P47_PIN_SEL      1
#if (LCD_P47_PIN_SEL == 2)
#define LCD_P47_GPIO         USBDM::GpioD<7>
#define LCD_P47_FN           0
#endif

// Pin Mapping for LCD_P47_fault signal
//   <o> LCD_P47_fault [PTD7]<name=LCD_P47_fault_PIN_SEL>
//   <i> Shows which pin LCD_P47_fault is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,LCD_P47_fault>
//     <0=> Default
#define LCD_P47_fault_PIN_SEL 0
#if (LCD_P47_fault_PIN_SEL == 1)
#define LCD_P47_fault_GPIO   USBDM::GpioD<7>
#define LCD_P47_fault_FN     7
#endif

// Pin Mapping for LCD_P48 signal
//   <o> LCD_P48 [PTE0]<name=LCD_P48_PIN_SEL>
//   <i> Shows which pin LCD_P48 is mapped to
//     <0=> Disabled
//     <1=> PTE0 (Alias:D14)<selection=PTE0_SIG_SEL,LCD_P48>
//     <0=> Default
#define LCD_P48_PIN_SEL      0
#if (LCD_P48_PIN_SEL == 1)
#define LCD_P48_GPIO         USBDM::GpioE<0>
#define LCD_P48_FN           0
#endif

// Pin Mapping for LCD_P48_fault signal
//   <o> LCD_P48_fault [PTE0]<name=LCD_P48_fault_PIN_SEL>
//   <i> Shows which pin LCD_P48_fault is mapped to
//     <0=> Disabled
//     <1=> PTE0 (Alias:D14)<selection=PTE0_SIG_SEL,LCD_P48_fault>
//     <0=> Default
#define LCD_P48_fault_PIN_SEL 0
#if (LCD_P48_fault_PIN_SEL == 1)
#define LCD_P48_fault_GPIO   USBDM::GpioE<0>
#define LCD_P48_fault_FN     7
#endif

// Pin Mapping for LCD_P49 signal
//   <o> LCD_P49 [PTE1]<name=LCD_P49_PIN_SEL>
//   <i> Shows which pin LCD_P49 is mapped to
//     <0=> Disabled
//     <1=> PTE1 (Alias:D15)<selection=PTE1_SIG_SEL,LCD_P49>
//     <0=> Default
#define LCD_P49_PIN_SEL      0
#if (LCD_P49_PIN_SEL == 1)
#define LCD_P49_GPIO         USBDM::GpioE<1>
#define LCD_P49_FN           0
#endif

// Pin Mapping for LCD_P49_fault signal
//   <o> LCD_P49_fault [PTE1]<name=LCD_P49_fault_PIN_SEL>
//   <i> Shows which pin LCD_P49_fault is mapped to
//     <0=> Disabled
//     <1=> PTE1 (Alias:D15)<selection=PTE1_SIG_SEL,LCD_P49_fault>
//     <0=> Default
#define LCD_P49_fault_PIN_SEL 0
#if (LCD_P49_fault_PIN_SEL == 1)
#define LCD_P49_fault_GPIO   USBDM::GpioE<1>
#define LCD_P49_fault_FN     7
#endif

